JaKaczocha/LPC55S69/PSW_Lab03_4/board/pin_mux.h
/*! @name PIO0_2 (number 81), U6[11]/P20[5]/FC3_SPI_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_ENC_B_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_B_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_ENC_B_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_B_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_ENC_B_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_3 (number 83), U3[11]/P20[3]/FC3_SPI_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_ENC_A_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_A_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_ENC_A_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_A_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_ENC_A_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_6 (number 89), U3[13]/P20[7]/FC3_SPI_SCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_ENC_S_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_S_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_ENC_S_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_ENC_S_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_ENC_S_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMODPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
